lib/cbraspag/templates/justclick/recurrency.xml.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <JustClickShop xmlns="http://www.cartaoprotegido.com.br/WebService/">
      <justClickShopRequestWS>
        <MerchantKey>guid</MerchantKey>
        <CustomerIdentification>string</CustomerIdentification>
        <CustomerName>string</CustomerName>
        <OrderId>string</OrderId>
        <Amount>int</Amount>
        <PaymentMethod>short</PaymentMethod>
        <NumberInstallments>short</NumberInstallments>
        <PaymentType>short</PaymentType>
        <JustClickKey>guid</JustClickKey>
        <SecurityCode>string</SecurityCode>
        <Country>string</Country>
        <Currency>string</Currency>
        <MerchantIdPagador>guid</MerchantIdPagador>
        <JustClickAlias>string</JustClickAlias>
      </justClickShopRequestWS>
    </JustClickShop>
  </soap:Body>
</soap:Envelope>