lib/braspag-pagador/templates/justclick/get_recurrency.xml.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetCreditCard xmlns="http://www.cartaoprotegido.com.br/WebService/">
      <getCreditCardRequestWS>
        <MerchantKey><%= merchant_id %></MerchantKey>
        <JustClickKey>guid</JustClickKey>
        <JustClickAlias>string</JustClickAlias>
      </getCreditCardRequestWS>
    </GetCreditCard>
  </soap:Body>
</soap:Envelope>