lib/braspag-pagador/templates/justclick/archive.xml.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SaveCreditCard xmlns="http://www.cartaoprotegido.com.br/WebService/">
      <saveCreditCardRequestWS>
        <MerchantKey><%= merchant_id %></MerchantKey>
        <CustomerIdentification><%= customer.cpf%></CustomerIdentification>
        <CustomerName><%= customer.name %></CustomerName>
        <CardHolder><%= credit_card.holder_name %></CardHolder>
        <CardNumber><%= credit_card.number %></CardNumber>
        <CardExpiration><%= credit_card.year + credit_card.month %></CardExpiration>
        <JustClickAlias><%= creditcard_alias%></JustClickAlias>
      </saveCreditCardRequestWS>
    </SaveCreditCard>
  </soap:Body>
</soap:Envelope>